"""
이게 왜 DP 야?
역으로?? 1부터 2?
1. 1 빼서 3의 배수인 경우
2. 3의 배수인 경우
3. 1 빼서 2의 배수인 경우
4. 2의 배수인 경우

dp[1] = 0
dp[2] = 1 # /2
dp[3] = 1 # /3
dp[4] = 2 # /2 /2       # -1 /3
dp[5] = 3 # -1 /2 /2    # -1 -1 /3
dp[6] = 2 # /3 /2
dp[7] = 3 # -1 /3 /2
dp[8] = 3 # /2 /2 /2
dp[9] = 2 # /3 /3
dp[10] = 3 # -1 /3 /3
dp[11] = 4 # -1 -1 /3 /3
dp[13] = 4 # -1 /3 /2 /2     # -1 /2 /3 /2
dp[16] = 4 # /2 /2 /2 /2      # -1 /3 -1 /2 /2
dp[17] = 5 # -1 /2 /2 /2 /2
dp[19] = 4 # -1 /3 /3 /2
dp[28] = 4 # /2 /2 -1 /3 /2  # -1 /3 /3 /3
dp[29] = 5 # -1 -1 /3 /3 /3  #28
dp[84] = 5 # /3 28          # -1-1-1 /3/3/3/3
"""
n = int(input())
dp = [[0] for _ in range(n+1)]
dp[1] = 0

# for i in range(2, n+1):
#     if (i % 3) == 0:
#         dp[i] = dp[i//3] + 1
#     elif  (i % 3) == 1:
#         dp[i] = dp[(i-1)//3] + 1
#     elif (i % 3) == 2:
#         pass
#     elif (i % 2) == 0:
#         dp[i] = dp[i//2] + 1
#     elif (i % 2) == 1:
#         dp[i] = dp[(i-1)//2] + 1
for i in range(2, n+1):
    dp[i] = dp[i-1] + 1
    if i % 3 == 0:
        dp[i] = min(dp[i], dp[i//3] + 1)
    # elif로 작성시 틀린다
    # 6의 배수일때 문제가 생기는거 아닐까?
    if i % 2 == 0:
        dp[i] = min(dp[i], dp[i//2] + 1)
print(dp[n])